package com.example.mindmap.util

class SelfCheckEvaluator {
    fun evaluate(score: Int): Pair<String, String> {
        return when (score) {
            in 0..4 -> "정상 범위" to "심리적으로 안정된 상태입니다. 유의한 수준의 우울감이 시사되지 않습니다."
            in 5..9 -> "가벼운 우울" to "다소 경미한 수준의 우울감이 있으나 일상생활에 지장을 줄 정도는 아닙니다. 다만, 이러한 기분상태가 지속될 경우 개인의 신체적, 심리적 대처자원을 저하시킬 수 있습니다. 그러한 경우, 가까운 지역센터나 전문기관을 방문하시기 바랍니다."
            in 10..19 -> "중간 정도의 우울" to "중간정도 수준의 우울감이 시사됩니다. 이러한 수준의 우울감은 흔히 신체적, 심리적 대처자원을 저하시키며 개인의 일상생활을 어렵게 만들기도 합니다. 가까운 지역센터나 전문기관을 방문하여 보다 상세한 평가와 도움을 받아보시기 바랍니다. "
            else -> "심한 우울" to "심한 수준의 우울감이 시사됩니다. 전문기관의 치료적 개입과 평가가 요구됩니다"
        }
    }
}
